---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyMonitorFailures.CannotCopyCuttingInsert
source: html/ca401dd8-eb6b-bc7d-25b4-5f1b2ce32346.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyMonitorFailures.CannotCopyCuttingInsert Property

Copy/Monitor does not support cutting inserts in floors. Some openings were not copied.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyCuttingInsert { get; }
```